# Lab 3.1. Data Structures in Pandas

## The previous section introduced the Pandas DataFrame and Series objects. These data structures resemble the primitive Python data containers (lists and dictionaries) for indexing and labeling, but have additional features that make working with data easier.

## This session will cover:
1. Loading in manual data
2. The Series object
3. Basic operations on Series objects
4. The DataFrame object
5. Conditional subsetting and fancy slicing and indexing
6. Saving out data”

# 0. Let's load and install some libraries

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
import sys

In [5]:
# we needd this library to save excel files
import sys
!{sys.executable} -m pip install xlwt

Requirement already satisfied: xlwt in c:\programdata\anaconda3\lib\site-packages (1.3.0)

WARNING: Error parsing requirements for thinc: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\thinc-8.0.1.dist-info\\METADATA'
WARNING: Error parsing requirements for srsly: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\srsly-2.4.0.dist-info\\METADATA'
WARNING: Error parsing requirements for spacy: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\spacy-3.0.3.dist-info\\METADATA'
WARNING: Error parsing requirements for catalogue: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\catalogue-2.0.1.dist-info\\METADATA'

In [6]:
# we needd this library to save excel (xlst) files
import sys
!{sys.executable} -m pip install openpyxl

Requirement already satisfied: openpyxl in c:\programdata\anaconda3\lib\site-packages (3.0.5)
Requirement already satisfied: jdcal in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in c:\programdata\anaconda3\lib\site-packages (from openpyxl) (1.0.1)

WARNING: Error parsing requirements for thinc: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\thinc-8.0.1.dist-info\\METADATA'
WARNING: Error parsing requirements for srsly: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\srsly-2.4.0.dist-info\\METADATA'
WARNING: Error parsing requirements for spacy: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\spacy-3.0.3.dist-info\\METADATA'
WARNING: Error parsing requirements for catalogue: [Errno 2] No such file or directory: 'c:\\programdata\\anaconda3\\lib\\site-packages\\catalogue-2.0.1.dist-info\\METADATA'

# 1. Let's create our own data

## 1.1. Creating a Series

### The Pandas Series is a one-dimensional container, similar to the built-in Python list. 
### A Pandas Series is very similar to a Python list, except that each element must be of the same dtype.

In [7]:
mySeries=pd.Series(['banana, apple, coconut,orange'])

In [8]:
mySeries

0    banana, apple, coconut,orange
dtype: object

In [9]:
otherSeries=pd.Series(['4.5','3.5','2.3','0.5','6.7'])

In [10]:
otherSeries

0    4.5
1    3.5
2    2.3
3    0.5
4    6.7
dtype: object

## 1.2. Creating a DataFrame from a dictionary

### The DataFrame is the most common Pandas object. It can be thought of as Python’s way of storing spreadsheet-like data.

### A DataFrame can be thought of as a dictionary of Series objects. This is why dictionaries are the the most common way of creating a DataFrame by hand.
### The key represents the column name, and the values are the contents of the column.

In [11]:
dictionaryOfScientists={'Name': ['Rosaline Franklin', 'William Gosset','Alexander Flemming','Carl F. Gauss'],
                        'Occupation': ['Chemist', 'Statistician','Physician','Mathematician'],
                        'Born': ['1920-07-25', '1876-06-13','1881-08-06','1777-04-10'],
                        'Died': ['1958-04-16', '1937-10-16','1954-03-11','1855-02-23'],
                        'Age': [37, 61,73,77]}

In [12]:
dictionaryOfScientists

{'Name': ['Rosaline Franklin',
  'William Gosset',
  'Alexander Flemming',
  'Carl F. Gauss'],
 'Occupation': ['Chemist', 'Statistician', 'Physician', 'Mathematician'],
 'Born': ['1920-07-25', '1876-06-13', '1881-08-06', '1777-04-10'],
 'Died': ['1958-04-16', '1937-10-16', '1954-03-11', '1855-02-23'],
 'Age': [37, 61, 73, 77]}

In [13]:
DataFrameOfScientists = pd.DataFrame(dictionaryOfScientists)

In [14]:
DataFrameOfScientists

                 Name     Occupation        Born        Died  Age
0   Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
1      William Gosset   Statistician  1876-06-13  1937-10-16   61
2  Alexander Flemming      Physician  1881-08-06  1954-03-11   73
3       Carl F. Gauss  Mathematician  1777-04-10  1855-02-23   77

## 1.3. Creating a DataFrame from records

### we can also create a DataFrame from some existing records

In [15]:
stocksRecords = [(3000, 'Google'), (213, 'Microsoft'), (1250, 'Apple'), (4500, 'Facebook'),(100, 'Tesla')]

In [16]:
stocksRecords

[(3000, 'Google'),
 (213, 'Microsoft'),
 (1250, 'Apple'),
 (4500, 'Facebook'),
 (100, 'Tesla')]

In [17]:
stocksDataFrame=pd.DataFrame.from_records(stocksRecords, columns=['Price', 'Company'])

## 2. Let's select some data

### 2.1. Selection based on column name

In [18]:
DataFrameOfScientists['Name']

0     Rosaline Franklin
1        William Gosset
2    Alexander Flemming
3         Carl F. Gauss
Name: Name, dtype: object

In [19]:
DataFrameOfScientists[['Name','Occupation']]

                 Name     Occupation
0   Rosaline Franklin        Chemist
1      William Gosset   Statistician
2  Alexander Flemming      Physician
3       Carl F. Gauss  Mathematician

### 2.2. Selection based on filter

In [20]:
# filter to select chemists
chemistFilter=DataFrameOfScientists['Occupation']=='Chemist'

In [21]:
DataFrameOfScientists[chemistFilter]

                Name Occupation        Born        Died  Age
0  Rosaline Franklin    Chemist  1920-07-25  1958-04-16   37

In [22]:
# filter to select those named Alexander Flemming
alexanderFlemmingFilter=DataFrameOfScientists['Name']=='Alexander Flemming'

In [23]:
DataFrameOfScientists[alexanderFlemmingFilter]

                 Name Occupation        Born        Died  Age
2  Alexander Flemming  Physician  1881-08-06  1954-03-11   73

In [24]:
# filter to select those named William 
# we use the function str.contains()
williamFilter=DataFrameOfScientists['Name'].str.contains('William')

In [25]:
DataFrameOfScientists[williamFilter]

             Name    Occupation        Born        Died  Age
1  William Gosset  Statistician  1876-06-13  1937-10-16   61

In [26]:
# filter to select by age
ageFilter=DataFrameOfScientists['Age']>=60

In [27]:
DataFrameOfScientists[ageFilter]

                 Name     Occupation        Born        Died  Age
1      William Gosset   Statistician  1876-06-13  1937-10-16   61
2  Alexander Flemming      Physician  1881-08-06  1954-03-11   73
3       Carl F. Gauss  Mathematician  1777-04-10  1855-02-23   77

In [28]:
# filter to select by age range [40,70]
ageFilter2=(DataFrameOfScientists['Age']>=40)&(DataFrameOfScientists['Age']<70)

In [29]:
DataFrameOfScientists[ageFilter2]

             Name    Occupation        Born        Died  Age
1  William Gosset  Statistician  1876-06-13  1937-10-16   61

### 2.3. Selection based on inverse filter

In [30]:
DataFrameOfScientists[~williamFilter]

                 Name     Occupation        Born        Died  Age
0   Rosaline Franklin        Chemist  1920-07-25  1958-04-16   37
2  Alexander Flemming      Physician  1881-08-06  1954-03-11   73
3       Carl F. Gauss  Mathematician  1777-04-10  1855-02-23   77

### 2.4. Slicing

In [31]:
DataFrameOfScientists.iloc[1:3]

                 Name    Occupation        Born        Died  Age
1      William Gosset  Statistician  1876-06-13  1937-10-16   61
2  Alexander Flemming     Physician  1881-08-06  1954-03-11   73

In [32]:
DataFrameOfScientists.iloc[1:4]

                 Name     Occupation        Born        Died  Age
1      William Gosset   Statistician  1876-06-13  1937-10-16   61
2  Alexander Flemming      Physician  1881-08-06  1954-03-11   73
3       Carl F. Gauss  Mathematician  1777-04-10  1855-02-23   77

In [33]:
DataFrameOfScientists.iloc[1:4,0:2]

                 Name     Occupation
1      William Gosset   Statistician
2  Alexander Flemming      Physician
3       Carl F. Gauss  Mathematician

In [34]:
DataFrameOfScientists.iloc[1:4,0:3]

                 Name     Occupation        Born
1      William Gosset   Statistician  1876-06-13
2  Alexander Flemming      Physician  1881-08-06
3       Carl F. Gauss  Mathematician  1777-04-10

In [35]:
DataFrameOfScientists.iloc[:,0:2]

                 Name     Occupation
0   Rosaline Franklin        Chemist
1      William Gosset   Statistician
2  Alexander Flemming      Physician
3       Carl F. Gauss  Mathematician

## 3. Let's perform some basic operations

In [36]:
# we multiply the Price column and save the result as a new column
stocksDataFrame['PriceDoubled']=stocksDataFrame['Price']*2

In [37]:
stocksDataFrame

   Price    Company  PriceDoubled
0   3000     Google          6000
1    213  Microsoft           426
2   1250      Apple          2500
3   4500   Facebook          9000
4    100      Tesla           200

In [38]:
# we compute the log of the column price
stocksDataFrame['PriceLog']=np.log(stocksDataFrame['Price'])

In [39]:
stocksDataFrame

   Price    Company  PriceDoubled  PriceLog
0   3000     Google          6000  8.006368
1    213  Microsoft           426  5.361292
2   1250      Apple          2500  7.130899
3   4500   Facebook          9000  8.411833
4    100      Tesla           200  4.605170

## 4. Let's perform some basic operations on time variables

In [40]:
# we transform the columns Born and Died to datetime64 format
DataFrameOfScientists['BornDateTimeFormat']=pd.to_datetime(DataFrameOfScientists['Born'])

In [41]:
DataFrameOfScientists['DiedDateTimeFormat']=pd.to_datetime(DataFrameOfScientists['Died'])

In [42]:
DataFrameOfScientists

,Name,Occupation,Born,Died,Age,BornDateTimeFormat,DiedDateTimeFormat
0,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37,1920-07-25,1958-04-16
1,William Gosset,Statistician,1876-06-13,1937-10-16,61,1876-06-13,1937-10-16
2,Alexander Flemming,Physician,1881-08-06,1954-03-11,73,1881-08-06,1954-03-11
3,Carl F. Gauss,Mathematician,1777-04-10,1855-02-23,77,1777-04-10,1855-02-23

In [43]:
DataFrameOfScientists['daysLived']=DataFrameOfScientists['DiedDateTimeFormat']-DataFrameOfScientists['BornDateTimeFormat']

In [44]:
DataFrameOfScientists

,Name,Occupation,Born,Died,Age,BornDateTimeFormat,DiedDateTimeFormat,daysLived
0,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37,1920-07-25,1958-04-16,13779 days
1,William Gosset,Statistician,1876-06-13,1937-10-16,61,1876-06-13,1937-10-16,22404 days
2,Alexander Flemming,Physician,1881-08-06,1954-03-11,73,1881-08-06,1954-03-11,26514 days
3,Carl F. Gauss,Mathematician,1777-04-10,1855-02-23,77,1777-04-10,1855-02-23,28442 days

In [45]:
DataFrameOfScientists['yearsLived']=DataFrameOfScientists['daysLived'].astype('timedelta64[Y]')

In [46]:
DataFrameOfScientists

,Name,Occupation,Born,Died,Age,BornDateTimeFormat,DiedDateTimeFormat,daysLived,yearsLived
0,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37,1920-07-25,1958-04-16,13779 days,37.0
1,William Gosset,Statistician,1876-06-13,1937-10-16,61,1876-06-13,1937-10-16,22404 days,61.0
2,Alexander Flemming,Physician,1881-08-06,1954-03-11,73,1881-08-06,1954-03-11,26514 days,72.0
3,Carl F. Gauss,Mathematician,1777-04-10,1855-02-23,77,1777-04-10,1855-02-23,28442 days,77.0

## 5. Let's export our data

### 5.1. Export as CSV

In [47]:
DataFrameOfScientists.to_csv('./DataFrameOfScientists.csv')

### 5.2. Export as Excel

In [48]:
DataFrameOfScientists.to_excel('./DataFrameOfScientists.xls')

### 5.3. Import a CSV

In [49]:
DataFrameOfScientists2=pd.read_csv('./DataFrameOfScientists.csv')

In [50]:
DataFrameOfScientists2

,Unnamed: 0,Name,Occupation,Born,Died,Age,BornDateTimeFormat,DiedDateTimeFormat,daysLived,yearsLived
0,0,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37,1920-07-25,1958-04-16,13779 days,37.0
1,1,William Gosset,Statistician,1876-06-13,1937-10-16,61,1876-06-13,1937-10-16,22404 days,61.0
2,2,Alexander Flemming,Physician,1881-08-06,1954-03-11,73,1881-08-06,1954-03-11,26514 days,72.0
3,3,Carl F. Gauss,Mathematician,1777-04-10,1855-02-23,77,1777-04-10,1855-02-23,28442 days,77.0

# 6. Challenge yourself !

## 6.1.   Load the gapminder dataset
### tip: have a look at Lab 2 for the code required to do so

## 6.2.   How has life expectancy evolved in China ?

## 6.3.   Plot the life expectancy evolution of China

## 6.4.   Which countries have gdpPerCap larger than 30000 dollars ?

## 6.4.   Which countries have gdpPerCap between 500 and 1000 dollars ?